app/views/scripts/show.html.erb

  <%= @script.previous_script_ids %>
  <% @script.previous_script_ids.split(',').map{ |e| Script.find(e)}.each do |pscript| %>
---
SELECT "scripts".* FROM "scripts" WHERE "scripts"."id" = $1 LIMIT 1  [["id", "1"]]