app/views/scripts/show.html.erb

  <%= @script.previous_script_ids %>
  <% @script.previous_script_ids.split(',').map{ |e| Script.all[e.to_i-1] }.each do |pscript| %>
---
SELECT "scripts".* FROM "scripts"