app/views/pipelines/_form.html.erb

      <td>Status</td>
      <% l1 = Status.all.map{|e| [e.name.upcase, e.id]} %>
---
SELECT "statuses".* FROM "statuses"