app/views/pipelines/index.html.erb

    <td><%= pipeline.email %></td>
    <td><span class="<%= Status.all[pipeline.status_id-1].name %>"><%= Status.all[pipeline.status_id-1].name.upcase %></span></td>
---
SELECT "statuses".* FROM "statuses"