app/controllers/input_outputs_controller.rb

  def index
    @input_outputs = InputOutput.all
---
SELECT "input_outputs".* FROM "input_outputs"