app/controllers/pfiles_controller.rb

SELECT "pfiles".* FROM "pfiles"
---
  def index
    @pfiles = Pfile.all