app/controllers/pipeline_items_controller.rb

  def index
    @pipeline_items = PipelineItem.all
---
SELECT "pipeline_items".* FROM "pipeline_items"

  def show
    @pipeline_item = PipelineItem.find(params[:id])
---
SELECT "pipeline_items".* FROM "pipeline_items" WHERE "pipeline_items"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @pipeline_item = PipelineItem.find(params[:id])
---
SELECT "pipeline_items".* FROM "pipeline_items" WHERE "pipeline_items"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @pipeline_item = PipelineItem.new(params[:pipeline_item])

    respond_to do |format|
      if @pipeline_item.save
---
INSERT INTO "pipeline_items" ("created_at", "exec_order", "pipeline_id", "script_id", "status_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 06 Mar 2012 15:19:00 UTC +00:00], ["exec_order", 1], ["pipeline_id", 2], ["script_id", 1], ["status_id", 5]]

  def update
    @pipeline_item = PipelineItem.find(params[:id])
---
SELECT "pipeline_items".* FROM "pipeline_items" WHERE "pipeline_items"."id" = $1 LIMIT 1  [["id", "1"]]