app/views/pipeline_items/_form.html.erb

      <td>Script</td>
      <% l2 = Script.all.map{|e| [e.label, e.id]} %>
---
SELECT "scripts".* FROM "scripts"

      <td>Pipeline</td>
      <% l1 = Pipeline.all.map{|e| [e.name, e.id]} %>
---
SELECT "pipelines".* FROM "pipelines"

      <td>Status</td>
      <% l3 = Status.all.map{|e| [e.name.upcase, e.id]} %>
---
SELECT "statuses".* FROM "statuses"