app/views/pipeline_items/index.html.erb

SELECT "scripts".* FROM "scripts"
SELECT "pipelines".* FROM "pipelines"
SELECT "statuses".* FROM "statuses"
---
    <td><%= pipeline_item.id %></td>
    <td><%= Script.all[pipeline_item.script_id-1].label %></td>
    <td><%= Pipeline.all[pipeline_item.pipeline_id-2].name %></td>
    <td><%= pipeline_item.exec_order %></td>
    <td><span class="<%= Status.all[pipeline_item.status_id-1].name %>"><%= Status.all[pipeline_item.status_id-1].name.upcase %></span></td>